# Pandas

Материалы:
* Макрушин С.В. "Лекция 2: Библиотека Pandas"
* https://pandas.pydata.org/docs/user_guide/index.html#
* https://pandas.pydata.org/docs/reference/index.html
* Уэс Маккини. Python и анализ данных

## Задачи для совместного разбора

In [185]:
import numpy as np
import pandas as pd

1. Загрузите данные из файла `sp500hst.txt` и обозначьте столбцы в соответствии с содержимым: `"date", "ticker", "open", "high", "low", "close", "volume"`.

In [186]:
data = pd.read_csv('sp500hst.txt', names = ["date", "ticker", "open", "high", "low", "close", "volume"])

In [187]:
data.head()

       date ticker   open     high     low  close  volume
0  20090821      A  25.60  25.6100  25.220  25.55   34758
1  20090824      A  25.64  25.7400  25.330  25.50   22247
2  20090825      A  25.50  25.7000  25.225  25.34   30891
3  20090826      A  25.32  25.6425  25.145  25.48   33334
4  20090827      A  25.50  25.5700  25.230  25.54   70176

2. Рассчитайте среднее значение показателей для каждого из столбцов c номерами 3-6.

In [188]:
for i in range(3,7):
    print(f'Средний показатель {data.columns[i]} = {data.iloc[:, i].mean()}')

Средний показатель high = 43.102243387667855
Средний показатель low = 42.05446366521448
Средний показатель close = 42.60186484817335
Средний показатель volume = 81395.06813843067

3. Добавьте столбец, содержащий только число месяца, к которому относится дата.

In [189]:
data['month'] = data['date'].apply(lambda x: int(str(x)[5:6]) if str(x)[4] == '0' else int(str(x)[4:6]))

In [190]:
data.sample(10)

            date ticker    open    high      low    close  volume  month
95925   20090914    RSH   16.37   16.67   16.240   16.630   37197      9
48169   20100716   GOOG  469.06  470.56  459.520  459.605   78247      7
113044  20091117    VFC   75.34   75.40   73.450   74.040    9950     11
117994  20091118    WMT   53.80   54.40   53.610   54.150  133609     11
97261   20091111    SCG   34.96   35.06   34.520   34.690    8534     11
45847   20100119    GCI   16.09   16.72   16.040   16.310   52365      1
83194   20090918   ORLY   37.04   37.58   36.700   37.420   19220      9
49266   20100113     GT   15.49   15.52   14.590   14.820   50633      1
22255   20100324     CL   85.16   85.18   84.090   84.340   21797      3
95009   20091218   ROST   44.30   44.54   42.897   42.900  280571     12

4. Рассчитайте суммарный объем торгов для для одинаковых значений тикеров.

In [191]:
data[['ticker', 'volume']].groupby(['ticker']).sum()

          volume
ticker
A        8609336
AA      81898998
AAPL    52261170
ABC      9006756
ABT     18975870
...          ...
XTO     21297931
YHOO    56837171
YUM     10971538
ZION    15551119
ZMH      4938916

[524 rows x 1 columns]

5. Загрузите данные из файла sp500hst.txt и обозначьте столбцы в соответствии с содержимым: "date", "ticker", "open", "high", "low", "close", "volume". Добавьте столбец с расшифровкой названия тикера, используя данные из файла `sp_data2.csv` . В случае нехватки данных об именах тикеров корректно обработать их.

In [192]:
arr1 = pd.read_csv('sp500hst.txt', names = ["date", "ticker", "open", "high", "low", "close", "volume"])
arr1.sample(5)

            date ticker    open    high     low   close  volume
47520   20091124    GME   25.74   25.90   25.17   25.28   39257
116740  20090930    WHR   70.59   71.22   69.15   69.96   14222
17652   20100302    CAG   24.84   24.95   24.80   24.90   41593
10956   20091223    AZO  159.52  161.33  159.14  160.28    5141
38746   20090917   ESRX   78.72   79.63   77.52   79.27   28138

In [193]:
arr2 = pd.read_csv('sp_data2.csv', delimiter=';', names=['ticker', 'company', 'procent'])
arr2.head(5), arr1.shape, arr2.shape

(  ticker     company procent
 0   AAPL       Apple    3.6%
 1   AMZN  Amazon.com    3.2%
 2  GOOGL    Alphabet    3.1%
 3   GOOG    Alphabet    3.1%
 4   MSFT   Microsoft    3.0%,
 (122574, 7),
 (505, 3))

In [194]:
arr2['procent']=arr2['procent'].apply(lambda x: float(x[:-1]))
arr2

    ticker          company  procent
0     AAPL            Apple      3.6
1     AMZN       Amazon.com      3.2
2    GOOGL         Alphabet      3.1
3     GOOG         Alphabet      3.1
4     MSFT        Microsoft      3.0
..     ...              ...      ...
500    SCG            SCANA      0.0
501    AIZ         Assurant      0.0
502    AYI    Acuity Brands      0.0
503    HRB        H&R Block      0.0
504    RRC  Range Resources      0.0

[505 rows x 3 columns]

In [195]:
arr3 = arr2.groupby(['ticker', 'company'], as_index=False).mean()
arr3

    ticker                  company  procent
0        A     Agilent Technologies      0.1
1      AAL  American Airlines Group      0.1
2      AAP       Advance Auto Parts      0.0
3     AAPL                    Apple      3.6
4     ABBV                   AbbVie      0.6
..     ...                      ...      ...
500    XYL                    Xylem      0.0
501    YUM               Yum Brands      0.1
502    ZBH   Zimmer Biomet Holdings      0.1
503   ZION            Zions Bancorp      0.0
504    ZTS                   Zoetis      0.2

[505 rows x 3 columns]

In [196]:
dictionary = dict(zip(arr3.ticker.values, arr3.company.values))
arr1['company'] = arr1['ticker'].map(dictionary)

In [197]:
arr1.tail(10)

            date ticker   open   high    low  close  volume company
122564  20100806    ZMH  54.08  54.30  53.26  53.98   15890     NaN
122565  20100809    ZMH  54.39  54.49  53.72  53.99   12170     NaN
122566  20100810    ZMH  53.61  54.40  53.29  53.90   21266     NaN
122567  20100811    ZMH  53.21  53.21  51.89  52.01   33017     NaN
122568  20100812    ZMH  51.45  52.32  51.31  52.00   28473     NaN
122569  20100813    ZMH  51.72  51.90  51.38  51.44   14561     NaN
122570  20100816    ZMH  51.13  51.47  50.60  51.00   13489     NaN
122571  20100817    ZMH  51.14  51.60  50.89  51.21   20498     NaN
122572  20100819    ZMH  51.63  51.63  50.17  50.22   18259     NaN
122573  20100820    ZMH  50.03  50.55  49.48  49.82   17792     NaN

In [198]:
# нераспознанные ticker в arr1
arr1.iloc[np.where(arr1['company'].isna())[0],:]['ticker'].unique()

array(['AA', 'ACE', 'ACS', 'AKS', 'ALTR', 'AN', 'ANF', 'AOC', 'APOL',
       'ARG', 'ATI', 'AVP', 'AYE', 'BBBY', 'BCR', 'BDK', 'BHI', 'BIG',
       'BJS', 'BMC', 'BMS', 'BNI', 'BRCM', 'BTU', 'CAM', 'CBE', 'CBG',
       'CCE', 'CEG', 'CEPH', 'CFN', 'CHK', 'CIEN', 'CLF', 'CNX', 'COH',
       'CPWR', 'CSC', 'CVG', 'CVH', 'DD', 'DELL', 'DF', 'DNB', 'DNR',
       'DO', 'DOW', 'DTV', 'DV', 'DYN', 'EK', 'EMC', 'EP', 'ERTS', 'ESV',
       'ETFCD', 'FDO', 'FHN', 'FII', 'FO', 'FPL', 'FRX', 'FSLR', 'FTR',
       'GAS', 'GCI', 'GENZ', 'GME', 'GNW', 'GR', 'HAR', 'HCBK', 'HCN',
       'HNZ', 'HOT', 'HSP', 'IGT', 'ITT', 'JAVA', 'JBL', 'JCP', 'JDSU',
       'JNS', 'KBH', 'KFT', 'KG', 'LIFE', 'LLTC', 'LM', 'LO', 'LSI',
       'LTD', 'LUK', 'LXK', 'MBI', 'MDP', 'MEE', 'MFE', 'MHP', 'MHS',
       'MI', 'MIL', 'MJN', 'MOLX', 'MON', 'MOT', 'MTW', 'MUR', 'MWV',
       'MWW', 'NBR', 'NOVL', 'NSM', 'NU', 'NVLS', 'NYT', 'NYX', 'ODP',
       'OI', 'PBG', 'PBI', 'PCL', 'PCLN', 'PCP', 'PCS', 'PDCO', 'PGN',
       'PLL', 'POM', 'PTV', 'Q', 'QEP', 'QLGC', 'R', 'RAI', 'RDC', 'RRD',
       'RSH', 'RX', 'S', 'SAI', 'SE', 'SGP', 'SHLD', 'SIAL', 'SII', 'SLE',
       'SLM', 'SNDK', 'SNI', 'SPLS', 'STJ', 'STR', 'SUN', 'SVU', 'SWN',
       'SWY', 'TDC', 'TE', 'TEG', 'TER', 'THC', 'TIE', 'TLAB', 'TSO',
       'TWC', 'URBN', 'VIA', 'VIA.B', 'WAG', 'WFMI', 'WFR', 'WIN', 'WLP',
       'WPI', 'WPO', 'WYE', 'WYN', 'X', 'XTO', 'YHOO', 'ZMH'],
      dtype=object)

In [199]:
arr1.company.fillna('no information', inplace=True)

In [200]:
arr1.isna().sum()

date       0
ticker     0
open       0
high       0
low        0
close      0
volume     0
company    0
dtype: int64

In [201]:
arr1.tail()

            date ticker   open   high    low  close  volume         company
122569  20100813    ZMH  51.72  51.90  51.38  51.44   14561  no information
122570  20100816    ZMH  51.13  51.47  50.60  51.00   13489  no information
122571  20100817    ZMH  51.14  51.60  50.89  51.21   20498  no information
122572  20100819    ZMH  51.63  51.63  50.17  50.22   18259  no information
122573  20100820    ZMH  50.03  50.55  49.48  49.82   17792  no information

## Лабораторная работа №2

### Базовые операции с `DataFrame`

1.1 В файлах `recipes_sample.csv` и `reviews_sample.csv` находится информация об рецептах блюд и отзывах на эти рецепты соответственно. Загрузите данные из файлов в виде `pd.DataFrame` с названиями `recipes` и `reviews`. Обратите внимание на корректное считывание столбца с индексами в таблице `reviews` (безымянный столбец).

In [202]:
recipes = pd.read_csv('recipes_sample.csv')
reviews = pd.read_csv('reviews_sample.csv', skiprows=1, names=['index', 'user_id', 'recipe_id',
                                                               'date', 'rating','review'])

In [203]:
reviews.head()

,index,user_id,recipe_id,date,rating,review
0,370476,21752,57993,2003-05-01,5,Last week whole sides of frozen salmon fillet ...
1,624300,431813,142201,2007-09-16,5,So simple and so tasty! I used a yellow capsi...
2,187037,400708,252013,2008-01-10,4,"Very nice breakfast HH, easy to make and yummy..."
3,706134,2001852463,404716,2017-12-11,5,These are a favorite for the holidays and so e...
4,312179,95810,129396,2008-03-14,5,Excellent soup! The tomato flavor is just gre...

In [204]:
recipes.head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
0,george s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0
1,healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN
2,i can t believe it s spinach,38798,30,1533,2002-08-29,NaN,"these were so go, it surprised even me.",8.0
3,italian gut busters,35173,45,22724,2002-07-27,NaN,my sister-in-law made these for us at a family...,NaN
4,love is in the air beef fondue sauces,84797,25,4470,2004-02-23,4.0,i think a fondue is a very romantic casual din...,NaN

In [205]:
reviews.shape, recipes.shape

((126696, 6), (30000, 8))

1.2 Для каждой из таблиц выведите основные параметры:
* количество точек данных (строк);
* количество столбцов;
* тип данных каждого столбца.

In [206]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126696 entries, 0 to 126695
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   index      126696 non-null  int64
 1   user_id    126696 non-null  int64
 2   recipe_id  126696 non-null  int64
 3   date       126696 non-null  object
 4   rating     126696 non-null  int64
 5   review     126679 non-null  object
dtypes: int64(4), object(2)
memory usage: 5.8+ MB

In [207]:
recipes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            30000 non-null  object
 1   id              30000 non-null  int64
 2   minutes         30000 non-null  int64
 3   contributor_id  30000 non-null  int64
 4   submitted       30000 non-null  object
 5   n_steps         18810 non-null  float64
 6   description     29377 non-null  object
 7   n_ingredients   21120 non-null  float64
dtypes: float64(2), int64(3), object(3)
memory usage: 1.8+ MB

1.3 Исследуйте, в каких столбцах таблиц содержатся пропуски. Посчитайте долю строк, содержащих пропуски, в отношении к общему количеству строк.

In [208]:
# процент пропусков в отзывах
reviews.isna().sum()/reviews.shape[0] * 100

index        0.000000
user_id      0.000000
recipe_id    0.000000
date         0.000000
rating       0.000000
review       0.013418
dtype: float64

In [209]:
# процент пропусков в рецептах
recipes.isna().sum()/recipes.shape[0] * 100

name               0.000000
id                 0.000000
minutes            0.000000
contributor_id     0.000000
submitted          0.000000
n_steps           37.300000
description        2.076667
n_ingredients     29.600000
dtype: float64

1.4 Рассчитайте среднее значение для каждого из числовых столбцов (где это имеет смысл).

In [210]:
# средний рейтинг в отзывах
reviews[['rating']].mean()

rating    4.410802
dtype: float64

In [211]:
recipes[['minutes', 'n_steps', 'n_ingredients']].mean()

minutes          123.358133
n_steps            9.805582
n_ingredients      9.008286
dtype: float64

1.5 Создайте серию из 10 случайных названий рецептов.

In [212]:
pd.Series(recipes.name.sample(10)).values

array(['st  patrick s day cupcakes', 'lemony corn on the cob',
       'strawberries with champagne and roses',
       'chocolate and hazelnut biscotti', 'dad s cheese ball',
       'german fridge cake', 'katzen s chocolate peanut butter brownies',
       'goldy bear s honey gingersnaps', 'round steak in it s own gravy',
       'raspberry shortbread cookies'], dtype=object)

1.6 Измените индекс в таблице `reviews`, пронумеровав строки, начиная с нуля.

In [213]:
reviews['index'] = np.arange(reviews.shape[0])

In [214]:
reviews

,index,user_id,recipe_id,date,rating,review
0,0,21752,57993,2003-05-01,5,Last week whole sides of frozen salmon fillet ...
1,1,431813,142201,2007-09-16,5,So simple and so tasty! I used a yellow capsi...
2,2,400708,252013,2008-01-10,4,"Very nice breakfast HH, easy to make and yummy..."
3,3,2001852463,404716,2017-12-11,5,These are a favorite for the holidays and so e...
4,4,95810,129396,2008-03-14,5,Excellent soup! The tomato flavor is just gre...
...,...,...,...,...,...,...
126691,126691,1270706,335534,2009-05-17,4,This recipe was great! I made it last night. I...
126692,126692,2282344,8701,2012-06-03,0,This recipe is outstanding. I followed the rec...
126693,126693,689540,222001,2008-04-08,5,"Well, we were not a crowd but it was a fabulou..."
126694,126694,2000242659,354979,2015-06-02,5,I have been a steak eater and dedicated BBQ gr...
126695,126695,463435,415599,2010-09-30,5,Wonderful and simple to prepare seasoning blen...

1.7 Выведите информацию о рецептах, время выполнения которых не больше 20 минут и кол-во ингредиентов в которых не больше 5.

In [215]:
recipes.loc[np.where((recipes.minutes <= 20) & (recipes.n_ingredients <=5))]

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
28,quick biscuit bread,302399,20,213909,2008-05-06,11.0,this is a wonderful quick bread to make as an ...,5.0
60,peas fit for a king or queen,303944,20,213909,2008-05-16,NaN,this recipe is so simple and the flavors are s...,5.0
90,hawaiian sunrise mimosa,100837,5,58104,2004-09-29,4.0,pineapple mimosa was changed to hawaiian sunri...,3.0
91,tasty dish s banana pudding in 2 minutes,286484,2,47892,2008-02-13,NaN,"""mmmm, i love bananas!"" a --tasty dish-- origi...",4.0
94,1 minute meatballs,11361,13,4470,2001-09-03,NaN,this is a real short cut for cooks in a hurry....,2.0
...,...,...,...,...,...,...,...,...
29873,zip and steam red potatoes with butter and garlic,304922,13,724218,2008-05-27,9.0,"i haven't tried this yet, but i am going to so...",5.0
29874,ziplock vanilla ice cream,74250,10,24386,2003-10-29,8.0,a fun thing for kids to do. may want to use mi...,3.0
29905,zucchini and corn with cheese,256177,15,305531,2007-09-29,4.0,from betty crocker fresh spring recipes. i lik...,5.0
29980,zucchini with jalapeno monterey jack,320622,10,305531,2008-08-20,3.0,simple and yummy!,3.0
29983,zucchini with serrano ham,162411,15,152500,2006-03-31,6.0,"this dish is from tim malzer, a german chef wh...",5.0

### Работа с датами в `pandas`

2.1 Преобразуйте столбец `submitted` из таблицы `recipes` в формат времени. Модифицируйте решение задачи 1.1 так, чтобы считать столбец сразу в нужном формате.

In [216]:
recipes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            30000 non-null  object
 1   id              30000 non-null  int64
 2   minutes         30000 non-null  int64
 3   contributor_id  30000 non-null  int64
 4   submitted       30000 non-null  object
 5   n_steps         18810 non-null  float64
 6   description     29377 non-null  object
 7   n_ingredients   21120 non-null  float64
dtypes: float64(2), int64(3), object(3)
memory usage: 1.8+ MB

In [217]:
recipes = pd.read_csv('recipes_sample.csv',converters={'submitted':pd.to_datetime})

In [218]:
recipes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            30000 non-null  object
 1   id              30000 non-null  int64
 2   minutes         30000 non-null  int64
 3   contributor_id  30000 non-null  int64
 4   submitted       30000 non-null  datetime64[ns]
 5   n_steps         18810 non-null  float64
 6   description     29377 non-null  object
 7   n_ingredients   21120 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(3), object(2)
memory usage: 1.8+ MB

2.2 Выведите информацию о рецептах, добавленных в датасет не позже 2010 года.

In [219]:
recipes.loc[recipes.submitted < '1/1/2011']

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
0,george s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0
1,healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN
2,i can t believe it s spinach,38798,30,1533,2002-08-29,NaN,"these were so go, it surprised even me.",8.0
3,italian gut busters,35173,45,22724,2002-07-27,NaN,my sister-in-law made these for us at a family...,NaN
4,love is in the air beef fondue sauces,84797,25,4470,2004-02-23,4.0,i think a fondue is a very romantic casual din...,NaN
...,...,...,...,...,...,...,...,...
29993,zuni caf zucchini pickles,316950,2895,62264,2008-07-31,NaN,refrigerator pickles for some of the zucchini ...,8.0
29995,zurie s holey rustic olive and cheddar bread,267661,80,200862,2007-11-25,16.0,this is based on a french recipe but i changed...,10.0
29996,zwetschgenkuchen bavarian plum cake,386977,240,177443,2009-08-24,NaN,"this is a traditional fresh plum cake, thought...",11.0
29997,zwiebelkuchen southwest german onion cake,103312,75,161745,2004-11-03,NaN,this is a traditional late summer early fall s...,NaN
29999,cookies by design cookies on a stick,298512,29,506822,2008-04-15,9.0,"i've heard of the 'cookies by design' company,...",10.0

### Работа со строковыми данными в `pandas`

3.1  Добавьте в таблицу `recipes` столбец `description_length`, в котором хранится длина описания рецепта из столбца `description`.

In [220]:
recipes['description_length'] = recipes['description'].apply(lambda x: len(str(x)))

3.2 Измените название каждого рецепта в таблице `recipes` таким образом, чтобы каждое слово в названии начиналось с прописной буквы.

In [221]:
recipes['name'] = recipes['name'].apply(lambda x: str(x)[0].upper() + str(x)[1:])

3.3 Добавьте в таблицу `recipes` столбец `name_word_count`, в котором хранится количество слов из названии рецепта (считайте, что слова в названии разделяются только пробелами). Обратите внимание, что между словами может располагаться несколько пробелов подряд.

In [222]:
recipes['name_word_count'] = recipes['name'].apply(lambda x:\
                            len([i for i in list(str(x)) if i not in ' ']))

In [224]:
recipes.head(4)

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients,description_length,name_word_count
0,George s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0,330,29
1,Healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN,255,29
2,I can t believe it s spinach,38798,30,1533,2002-08-29,NaN,"these were so go, it surprised even me.",8.0,39,22
3,Italian gut busters,35173,45,22724,2002-07-27,NaN,my sister-in-law made these for us at a family...,NaN,154,17

### Группировки таблиц `pd.DataFrame`

4.1 Посчитайте количество рецептов, представленных каждым из участников (`contributor_id`). Какой участник добавил максимальное кол-во рецептов?

In [225]:
recipes[['id', 'contributor_id']].groupby(by='contributor_id').count()

                 id
contributor_id
1530              5
1533            186
1534             50
1535             40
1538              8
...             ...
2001968497        2
2002059754        1
2002234079        1
2002234259        1
2002247884        1

[8404 rows x 1 columns]

4.2 Посчитайте средний рейтинг к каждому из рецептов. Для скольких рецептов отсутствуют отзывы? Обратите внимание, что отзыв с нулевым рейтингом или не заполненным текстовым описанием не считается отсутствующим.

In [226]:
reviews[['recipe_id', 'rating']].groupby(by='recipe_id').mean()

             rating
recipe_id
48         1.000000
55         4.750000
66         4.944444
91         4.750000
94         5.000000
...             ...
536547     5.000000
536610     0.000000
536728     4.000000
536729     4.750000
536747     0.000000

[28100 rows x 1 columns]

4.3 Посчитайте количество рецептов с разбивкой по годам создания.

In [228]:
recipes['year'] = recipes['submitted'].apply(lambda x: x.year)
recipes[['id', 'year']].groupby(by='year').count()

        id
year
1999   275
2000   104
2001   589
2002  2644
2003  2334
2004  2153
2005  3130
2006  3473
2007  4429
2008  4029
2009  2963
2010  1538
2011   922
2012   659
2013   490
2014   139
2015    42
2016    24
2017    39
2018    24

### Объединение таблиц `pd.DataFrame`

5.1 При помощи объединения таблиц, создайте `DataFrame`, состоящий из четырех столбцов: `id`, `name`, `user_id`, `rating`. Рецепты, на которые не оставлен ни один отзыв, должны отсутствовать в полученной таблице. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и попытавшись найти строку, соответствующую этому рецепту, в полученном `DataFrame`.

In [229]:
reviews.shape, recipes.shape

((126696, 6), (30000, 11))

In [230]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126696 entries, 0 to 126695
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   index      126696 non-null  int64
 1   user_id    126696 non-null  int64
 2   recipe_id  126696 non-null  int64
 3   date       126696 non-null  object
 4   rating     126696 non-null  int64
 5   review     126679 non-null  object
dtypes: int64(4), object(2)
memory usage: 5.8+ MB

In [231]:
# indicies of nans in reviews
idx = np.where(reviews['review'].isna())[0]
idx

array([  8881,  12129,  18578,  21913,  33232,  42783,  42855,  43551,
        53998,  55100,  56197,  59803,  67973,  71067,  96199, 105206,
       109590])

In [232]:
reviews.loc[idx]
# для проверки возьмем id = 245231

         index     user_id  recipe_id        date  rating review
8881      8881  2001567544       9054  2017-06-03       5    NaN
12129    12129  2002120930     167202  2018-04-18       4    NaN
18578    18578  2001508809       9054  2017-04-26       5    NaN
21913    21913  2001959957     335709  2018-01-28       5    NaN
33232    33232  2002299388      15553  2018-10-13       4    NaN
42783    42783  2002060663     107786  2018-03-18       5    NaN
42855    42855  2001346906     522925  2017-01-11       4    NaN
43551    43551  1800574364     391660  2018-08-22       5    NaN
53998    53998  2002005298     245231  2018-02-22       5    NaN
55100    55100  2001826405       9054  2017-11-26       5    NaN
56197    56197  2001658714     155430  2017-08-05       5    NaN
59803    59803  2002252901      25190  2018-08-29       5    NaN
67973    67973  2001779476       3662  2017-11-05       4    NaN
71067    71067  2001785348     524744  2017-11-26       5    NaN
96199    96199  2002057405      89207  2018-03-17       5    NaN
105206  105206  2001380233     128956  2017-02-05       5    NaN
109590  109590  1803237930      86868  2018-03-20       5    NaN

In [233]:
reviews_part = reviews.dropna()

In [234]:
recipes_part = recipes[['id', 'name']]
recipes_part.head(4)

      id                                   name
0  44123  George s at the cove  black bean soup
1  67664     Healthy for them  yogurt popsicles
2  38798           I can t believe it s spinach
3  35173                   Italian  gut busters

In [235]:
recipe_part.rename(columns={'recipe_id': 'id'}, inplace=True)

/tmp/ipykernel_217440/1280029092.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  reviews_part.rename(columns={'recipe_id': 'id'}, inplace=True)

In [242]:
reviews_part = reviews_part[['id', 'user_id', 'rating']]
reviews_part

            id     user_id  rating
0        57993       21752       5
1       142201      431813       5
2       252013      400708       4
3       404716  2001852463       5
4       129396       95810       5
...        ...         ...     ...
126691  335534     1270706       4
126692    8701     2282344       0
126693  222001      689540       5
126694  354979  2000242659       5
126695  415599      463435       5

[126679 rows x 3 columns]

In [243]:
df = reviews_part.merge(recipes_part, how='inner', on='id')
df

            id  user_id  rating                                    name
0        57993    21752       5                    Salmon with tomatoes
1        57993    86359       5                    Salmon with tomatoes
2        57993    67026       5                    Salmon with tomatoes
3        57993   371697       5                    Salmon with tomatoes
4        57993   175286       5                    Salmon with tomatoes
...        ...      ...     ...                                     ...
126674   94096   157617       5                     Vegetable pasta pie
126675  368208  1207345       2                    Crockery pot delight
126676  154964   357323       5        Apple cider cheesecake   no cook
126677  187418   160974       5                Winter vegetable lasagna
126678  296868    95743       4  G nut special sauce and sweet potatoes

[126679 rows x 4 columns]

In [246]:
# для проверки возьмем user_id = 2001567544	and id = 9054
df.loc[np.where((df['id'] == 9054) & (df['user_id'] == 2001567544))]

Empty DataFrame
Columns: [id, user_id, rating, name]
Index: []

5.2 При помощи объединения таблиц и группировок, создайте `DataFrame`, состоящий из трех столбцов: `recipe_id`, `name`, `review_count`, где столбец `review_count` содержит кол-во отзывов, оставленных на рецепт `recipe_id`. У рецептов, на которые не оставлен ни один отзыв, в столбце `review_count` должен быть указан 0. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и найдя строку, соответствующую этому рецепту, в полученном `DataFrame`.

In [274]:
recipes

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients,description_length,name_word_count,year
0,George s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0,330,29,2002
1,Healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN,255,29,2003
2,I can t believe it s spinach,38798,30,1533,2002-08-29,NaN,"these were so go, it surprised even me.",8.0,39,22,2002
3,Italian gut busters,35173,45,22724,2002-07-27,NaN,my sister-in-law made these for us at a family...,NaN,154,17,2002
4,Love is in the air beef fondue sauces,84797,25,4470,2004-02-23,4.0,i think a fondue is a very romantic casual din...,NaN,587,30,2004
...,...,...,...,...,...,...,...,...,...,...,...
29995,Zurie s holey rustic olive and cheddar bread,267661,80,200862,2007-11-25,16.0,this is based on a french recipe but i changed...,10.0,484,37,2007
29996,Zwetschgenkuchen bavarian plum cake,386977,240,177443,2009-08-24,NaN,"this is a traditional fresh plum cake, thought...",11.0,286,32,2009
29997,Zwiebelkuchen southwest german onion cake,103312,75,161745,2004-11-03,NaN,this is a traditional late summer early fall s...,NaN,311,37,2004
29998,Zydeco soup,486161,60,227978,2012-08-29,NaN,this is a delicious soup that i originally fou...,NaN,648,10,2012
29999,Cookies by design cookies on a stick,298512,29,506822,2008-04-15,9.0,"i've heard of the 'cookies by design' company,...",10.0,125,30,2008

In [275]:
reviews_part = reviews[['recipe_id', 'review']].groupby(by='recipe_id', as_index=False).count()

In [277]:
reviews_part.rename(columns={'review':'review_count'},inplace=True)
recipes_part = recipes.rename(columns={'id':'recipe_id'})

In [283]:
recipes_part = recipes_part[['recipe_id', 'name']]

In [285]:
recipes_part.head(2)

   recipe_id                                   name
0      44123  George s at the cove  black bean soup
1      67664     Healthy for them  yogurt popsicles

In [282]:
reviews_part.head(2)

   recipe_id  review_count
0         48             2
1         55             4

In [289]:
df = recipes_part.merge(reviews_part, how='left', on='recipe_id')
df

       recipe_id                                          name  review_count
0          44123         George s at the cove  black bean soup           3.0
1          67664            Healthy for them  yogurt popsicles           8.0
2          38798                  I can t believe it s spinach           3.0
3          35173                          Italian  gut busters           1.0
4          84797      Love is in the air  beef fondue   sauces           8.0
...          ...                                           ...           ...
29995     267661  Zurie s holey rustic olive and cheddar bread           4.0
29996     386977          Zwetschgenkuchen  bavarian plum cake           2.0
29997     103312   Zwiebelkuchen   southwest german onion cake           6.0
29998     486161                                   Zydeco soup           6.0
29999     298512        Cookies by design   cookies on a stick           1.0

[30000 rows x 3 columns]

In [304]:
df.isna().sum()

recipe_id          0
name               0
review_count    1900
dtype: int64

In [306]:
df.fillna(0, inplace=True)

In [308]:
# check recipe which has not reviews
df.loc[np.where(df['review_count'] == 0)]

       recipe_id                                     name  review_count
26        223349            Pasta  with shrimp   eggplant           0.0
29        342620          Secret ingredient  bbq meatloaf           0.0
35        276594        Windy s  sweet and sour meatballs           0.0
49        216068  Goulashy  beef stew for the slow cooker           0.0
59        306590             Old bay  grilled steak fries           0.0
...          ...                                      ...           ...
29871      66966                       Zingy potato salad           0.0
29903     249846       Zucchini  mock green papaya  salad           0.0
29905     256177            Zucchini and corn with cheese           0.0
29951     178243                       Zucchini nut salad           0.0
29979     363362     Zucchini with bell pepper and tomato           0.0

[1900 rows x 3 columns]

5.3. Выясните, рецепты, добавленные в каком году, имеют наименьший средний рейтинг?

In [333]:
recipes_part = recipes[['id', 'name', 'year']]
recipes_part.rename(columns={'id':'recipe_id'}, inplace=True)
recipes_part

/tmp/ipykernel_217440/2024960507.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  recipes_part.rename(columns={'id':'recipe_id'}, inplace=True)

       recipe_id                                          name  year
0          44123         George s at the cove  black bean soup  2002
1          67664            Healthy for them  yogurt popsicles  2003
2          38798                  I can t believe it s spinach  2002
3          35173                          Italian  gut busters  2002
4          84797      Love is in the air  beef fondue   sauces  2004
...          ...                                           ...   ...
29995     267661  Zurie s holey rustic olive and cheddar bread  2007
29996     386977          Zwetschgenkuchen  bavarian plum cake  2009
29997     103312   Zwiebelkuchen   southwest german onion cake  2004
29998     486161                                   Zydeco soup  2012
29999     298512        Cookies by design   cookies on a stick  2008

[30000 rows x 3 columns]

In [348]:
reviews_part = reviews[['recipe_id', 'rating']].\
groupby(by='recipe_id', as_index=False).mean()
reviews_part

       recipe_id    rating
0             48  1.000000
1             55  4.750000
2             66  4.944444
3             91  4.750000
4             94  5.000000
...          ...       ...
28095     536547  5.000000
28096     536610  0.000000
28097     536728  4.000000
28098     536729  4.750000
28099     536747  0.000000

[28100 rows x 2 columns]

In [356]:
# года с наименьшим рейтингом
df = recipes_part.merge(reviews_part, how='inner', on='recipe_id').drop_duplicates()
df.loc[np.where(df['rating'] == 0)]['year'].unique()

array([2005, 2006, 2011, 2017, 2002, 2003, 2009, 2007, 2013, 2000, 2008,
       2012, 2016, 2010, 2001, 2004, 1999, 2015, 2014, 2018])

In [357]:
df = recipes_part.merge(reviews_part, how='inner', on='recipe_id').drop_duplicates()

In [359]:
df

       recipe_id                                          name  year    rating
0          44123         George s at the cove  black bean soup  2002  5.000000
1          67664            Healthy for them  yogurt popsicles  2003  5.000000
2          38798                  I can t believe it s spinach  2002  3.666667
3          35173                          Italian  gut busters  2002  4.000000
4          84797      Love is in the air  beef fondue   sauces  2004  4.000000
...          ...                                           ...   ...       ...
28095     267661  Zurie s holey rustic olive and cheddar bread  2007  3.750000
28096     386977          Zwetschgenkuchen  bavarian plum cake  2009  5.000000
28097     103312   Zwiebelkuchen   southwest german onion cake  2004  3.666667
28098     486161                                   Zydeco soup  2012  5.000000
28099     298512        Cookies by design   cookies on a stick  2008  1.000000

[28100 rows x 4 columns]

### Сохранение таблиц `pd.DataFrame`

6.1 Отсортируйте таблицу в порядке убывания величины столбца `name_word_count` и сохраните результаты выполнения заданий 3.1-3.3 в csv файл.

In [361]:
recipes.sort_values(by='name_word_count', inplace=True)

In [363]:
recipes.to_csv('recipes_3.1_3.3', index=False)

6.2 Воспользовавшись `pd.ExcelWriter`, cохраните результаты 5.1 и 5.2 в файл: на лист с названием `Рецепты с оценками` сохраните результаты выполнения 5.1; на лист с названием `Количество отзывов по рецептам` сохраните результаты выполнения 5.2.